# HGetLayerTransp

## Description
Get the transparency of the specified layer.

```pascal
FUNCTION HGetLayerTransp(hLayer : HANDLE): REAL;
```

```python
def vs.HGetLayerTransp(hLayer):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hLayer|HANDLE|Handle to the layer.|

## See Also
VS Functions:
HSetLayerTransp
| GetLayerTransparency

## Version
Availability: from Vectorworks 2013

## Category
* Layers